{"0": {"index": 0, "short_name": "3D", "full_name": "Are your images 3D?", "select_all": false, "slider": false, "long_description": "Whether or not the images you wish to analyze are 3D.", "section": "image", "changes_based_on_3d": false, "options": {"Yes": {"cellprofiler_suggester": "You said your images are 3D. Please make sure to select this in the NamesAndTypes module"}, "No": {"cellprofiler_suggester": "You said your images are 2D. Please make sure to select this in the NamesAndTypes module"}, "Yes, but I wish to Z project them before proceeding": {"cellprofiler_suggester": "You said your images are 3D but need projection. Please first run a pipeline to project them (a written and video demo are available [here](https://forum.image.sc/t/input-modules-tutorial/63911#h-3d-processing-4814-6)). Once these are created, the now-2D projections can be used in their own CellProfiler pipeline."}}, "default_option_index": 1}, "1": {"index": 1, "short_name": "microscope_methodology", "full_name": "Microscope methodology?", "select_all": false, "slider": false, "long_description": "Whether the image that will eventually be used for segmentation (possibly after post-processing) is unstained brightfield (including phase contrast and DIC), histology stained brightfield, or fluorescence.", "section": "image", "changes_based_on_3d": false, "options": {"Brightfield - unstained": {"cellprofiler_suggester": "You said your images are unstained brightfield. CellProfiler requires your images be bright in the areas you wish to segment and dim in the areas you don't; this is rarely the case with unstained brightfield. EnhanceOrSuppressFeatures in 'Texture' mode may be sufficient for what you need; if not, then using a pixel classification tool like ilastik or Trainable Weka Segmentation before using CellProfiler may help get your data into the format you need (see our Pixel Classification tutorial for more details). You can also consider using a neural network tool such as Cellpose that allows direct segmentation from brightfield (either before using CellProfiler or using the RunCellpose plugin)."}, "Brightfield - histology stained": {"cellprofiler_suggester": "You said your images are histologically stained. CellProfiler requires your images be bright in the areas you wish to segment and dim in the areas you don't; the UnmixColor module can do this for you. Note that this module does not support 3D in CellProfiler 4, but this functionality is avaialable when CellProfiler is installed from source and will be included in CellProfiler 5."}, "Fluorescence": {"cellprofiler_suggester": "You said your images are flurorescent. CellProfiler requires your images be bright in the areas you wish to segment and dim in the areas you don't; if at least one channel of your images already looks like this, nothing else is needed. If you want to segment the dimmer rather than the brighter parts of your fluorescent signal (such as segmenting nuclei from the dimmer 'holes' in ie an actin stain), you may find that using ImageMath's 'Invert' option helps you, though you will likely need to mask out background pixels for this strategy to succeed."}}, "default_option_index": 2}, "15": {"index": 15, "short_name": "median_diameter", "full_name": "Median object diameter", "select_all": false, "slider": true, "long_description": "The median diameter of the object you want to segment, in pixels", "section": "object", "changes_based_on_3d": true, "options": {"1-3 px": {"cellprofiler_suggester": {"3D_False": "In IdentifyPrimaryObjects, a good initial guess of 'Typical Object Diameter' is 1-5", "3D_True": false}}, "3-10 px": {"cellprofiler_suggester": {"3D_False": "In IdentifyPrimaryObjects, a good initial guess of 'Typical Object Diameter' is 2-8", "3D_True": false}}, "10-30 px": {"cellprofiler_suggester": {"3D_False": "In IdentifyPrimaryObjects, a good initial guess of 'Typical Object Diameter' is 8-40", "3D_True": false}}, "30-100 px": {"cellprofiler_suggester": {"3D_False": "In IdentifyPrimaryObjects, a good initial guess of 'Typical Object Diameter' is 25-120", "3D_True": false}}, "100-300 px": {"cellprofiler_suggester": {"3D_False": "In IdentifyPrimaryObjects, a good initial guess of 'Typical Object Diameter' is 80-350", "3D_True": false}}, "300-1000 px": {"cellprofiler_suggester": {"3D_False": "In IdentifyPrimaryObjects, a good initial guess of 'Typical Object Diameter' is 250-1200", "3D_True": false}}, "1000-3000 px": {"cellprofiler_suggester": {"3D_False": "In IdentifyPrimaryObjects, a good initial guess of 'Typical Object Diameter' is 800-3500", "3D_True": false}}}, "default_option_index": 3}, "19": {"index": 19, "short_name": "meas_other_objects", "full_name": "Measurements requring other objects and/or image context (select all that apply)", "select_all": true, "slider": false, "long_description": "Measurements that don't come from just the object being measured, but from its relationship to some other object. This might be an object of the same kind (such as a cell's distance to its closest cell) OR a different kind of object (such as the number of speckles inside a nucleus)", "section": "measurement", "changes_based_on_3d": true, "options": {"Count of parent/child objects of a different type": {"cellprofiler_suggester": {"3D_False": "To measure the count of parent/child objects of a different type, once both kinds of objects (the larger 'parent' objects and the smaller 'child' objects have been found), use the RelateObjects module to connect them. If you want to calculate per-parent means (ie if you want to know in each nucleus, what is the average speckle area), make sure to put RelateObjects AFTER your measurement modules", "3D_True": "To measure the count of parent/child objects of a different type, once both kinds of objects (the larger 'parent' objects and the smaller 'child' objects have been found), use the RelateObjects module to connect them. If you want to calculate per-parent means (ie if you want to know in each nucleus, what is the average speckle area), make sure to put RelateObjects AFTER your measurement modules"}}, "Distance to/overlap with other objects of same type": {"cellprofiler_suggester": {"3D_False": "You said you wanted to measure distance to and/or overlap with other objects of the same type. CellProfiler only supports direct object overlap under certain circumstances, such as the UntangleWorms module, and doesn't currently have a good way of measuring it. If you want to calculate distance, you can use the MeasureObjectNeighbors module", "3D_True": "You said you wanted to measure distance to and/or overlap with other objects of the same type. CellProfiler currently doesn't support object overlap in 3D. If you want to calculate distance, you can use the MeasureObjectNeighbors module"}}, "Distance to/overlap with other objects of a different type": {"cellprofiler_suggester": {"3D_False": "You said you wanted to measure distance to and/or overlap with another kind of object. This can be measured with the MeasureObjectNeighbors module and/or the MeasureObjectOverlap module", "3D_True": "You said you wanted to measure distance to and/or overlap with another kind of object. Unfortunately, CellProfiler currently doesn't calculate object overlap in 3D. If you want to calculate distance, you can use the MeasureObjectNeighbors module"}}}, "default_option_index": 0}}